tests/assets/test_suites/w3c_wsdl20/messages/good/InOut-4G/canontoaxis-inout.descmsg

<?xml version="1.0" encoding="UTF-8"?>
<!-- https://dev.w3.org/2002/ws/desc/test-suite/messages/good/InOut-4G/canontoaxis-inout.descmsg -->
<!-- Copyright © 2008 - W3C, (MIT, ERCIM, Keio). All Rights Reserved. http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231 -->
<log xmlns="http://www.w3.org/2002/ws/desc/logs/">
<message timestamp="2006-07-06T14:13:33.720Z" conversation="1" number="1" type="request">
<senderHostAndPort>KERGUELEN:1596</senderHostAndPort>
<receiverHostAndPort>chathura.dyndns.ws:8080</receiverHostAndPort>
<httpHeaders>
<Method value="POST">
<uri>/axis2/services/echoService</uri>
</Method>
<Host>chathura.dyndns.ws:8080</Host>
<Pragma>no-cache</Pragma>
<Accept>*/*</Accept>
<Content-Type type="application/soap+xml">application/soap+xml;action=""</Content-Type>
<Content-Length>301</Content-Length>

</httpHeaders>
<content><?_xml version="1.0"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"><env:Body><ns1:echoXML xmlns:ns1="http://www.wso2.com/schemas/2006/interop/EchoService"><echoXMLParam><ns2:testName xmlns:ns2="testNs">testValue</ns2:testName></echoXMLParam></ns1:echoXML></env:Body></env:Envelope></content>
</message>
<message timestamp="2006-07-06T14:13:33.911Z" conversation="1" number="2" type="response">
<senderHostAndPort>chathura.dyndns.ws:8080</senderHostAndPort>
<receiverHostAndPort>KERGUELEN:1596</receiverHostAndPort>
<httpHeaders>
<StatusCode value="200">HTTP/1.1 200 OK</StatusCode>
<Server>Apache-Coyote/1.1</Server>
<Set-Cookie>JSESSIONID=73EE3E7EAC092AD3A5BFD4896E2F55DB; Path=/axis2</Set-Cookie>
<Content-Type type="application/soap+xml">application/soap+xml;charset=UTF-8</Content-Type>
<Transfer-Encoding>chunked</Transfer-Encoding>
<Date>Thu, 06 Jul 2006 19:13:23 GMT</Date>

</httpHeaders>
<content><?_xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><echoXMLResponse xmlns="http://www.wso2.com/schemas/2006/interop/EchoService"><echoXMLParam xmlns=""><ns2:testName xmlns:ns2="testNs">testValue</ns2:testName></echoXMLParam></echoXMLResponse></soapenv:Body></soapenv:Envelope></content>
</message>
</log>
